app/controllers/cars_controller.rb

  def garage
    @cars = Car.all
    if (User.find_by_username(params[:id]))
---
SELECT "cars".* FROM "cars"
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "jorkata"], ["LIMIT", 1]]

  def show
    @comment = current_user.comments.new
    @comments = Comment.order("id DESC")
---
SELECT  "comments".* FROM "comments" WHERE "comments"."car_id" = ? ORDER BY "comments"."id" ASC LIMIT ?  [["car_id", 2], ["LIMIT", 1]]

  def create
    @car = current_user.cars.build(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("make", "model", "engine", "transmission", "description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["image_file_name", "HLq0STB.jpg"], ["image_file_size", 531843], ["image_updated_at", "2020-11-26 22:38:56.649381"], ["updated_at", "2020-11-26 22:38:56.808611"], ["id", 18]]