app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.build([{content:"anything"}, {car_id: 13}])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "car_id") VALUES (?, ?, ?, ?, ?)  [["content", "well hope it works\n"], ["created_at", "2020-11-24 20:13:35.411046"], ["updated_at", "2020-11-24 20:13:35.411046"], ["user_id", 2], ["car_id", 14]]