app/views/cars/garage.html.haml

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "asd"], ["LIMIT", 1]]
---
    - @cars.each do |car|
        -if car.user_id == User.find_by_username(params[:id]).id
            .col-12.garage